AO1/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1e-5;

vertices
(
	(0 150 -6.54)		//0
     	(0 161 -7.0196) 		//1
	(0 200 -8.72) 		//2
	(0 318 -13.8648) 	//3
	(300 150 -6.54)		//4
	(300 161 -7.0196)	//5
	(300 200 -8.72)		//6
	(300 318 -13.8648)	//7
	(400 150 -6.54)		//8
	(400 161 -7.0196)	//9 // OD
	(400 200 -8.72)		//10
	(400 318 -13.8648)	//11
	(410 150 -6.54)		//12
	(410 161 -7.0196)	//13 //OD
	(527 150 -6.54)		//14 //change starts from here
	(527 161 -7.0196)	//15 //OD
 	(527 180 -7.848)	//16
	(527 238 -10.3768)	//17
	(627 150 -6.54)		//18
	(627 161 -7.0196)	//19
	(627 180 -7.848)	//20
	(627 238 -10.3768)	//21
	(927 150 -6.54)		//22
	(927 161 -7.0196)	//23
	(927 180 -7.848)	//24
	(927 238 -10.3768)	//25	
	
	(0 150 6.54)		//0
     	(0 161 7.0196) 		//1
	(0 200 8.72) 		//2
	(0 318 13.8648) 	//3
	(300 150 6.54)		//4
	(300 161 7.0196)	//5
	(300 200 8.72)		//6
	(300 318 13.8648)	//7
	(400 150 6.54)		//8
	(400 161 7.0196)	//9 // OD
	(400 200 8.72)		//10
	(400 318 13.8648)	//11
	(410 150 6.54)		//12
	(410 161 7.0196)	//13 //OD
	(527 150 6.54)		//14 //change starts from here
	(527 161 7.0196)	//15 //OD
 	(527 180 7.848)		//16
	(527 238 10.3768)	//17
	(627 150 6.54)		//18
	(627 161 7.0196)	//19
	(627 180 7.848)		//20
	(627 238 10.3768)	//21
	(927 150 6.54)		//22
	(927 161 7.0196)	//23
	(927 180 7.848)		//24
	(927 238 10.3768)	//25		
);

blocks
(
    hex (0 4 5 1 26 30 31 27) (70 20 1) simpleGrading (1 1 1)
    hex (1 5 6 2 27 31 32 28) (70 20 1) simpleGrading (1 1 1)
    hex (2 6 7 3 28 32 33 29) (70 20 1) simpleGrading (1 1 1)

    hex (4 8 9 5 30 34 35 31) (30 20 1) simpleGrading (1 1 1) 
    hex (5 9 10 6 31 35 36 32) (30 20 1) simpleGrading (1 1 1)
    hex (6 10 11 7 32 36 37 33) (30 20 1) simpleGrading (1 1 1)

    hex (8 12 13 9 34 38 39 35) (10 20 1) simpleGrading (1 1 1)
    hex (12 14 15 13 38 40 41 39) (100 20 1) simpleGrading (1 1 1)

    hex (14 18 19 15 40 44 45 41) (30 20 1) simpleGrading (1 1 1)
    hex (15 19 20 16 41 45 46 42) (30 20 1) simpleGrading (1 1 1)
    hex (16 20 21 17 42 46 47 43) (30 20 1) simpleGrading (1 1 1)

    hex (18 22 23 19 44 48 49 45) (70 20 1) simpleGrading (1 1 1)
    hex (19 23 24 20 45 49 50 46) (70 20 1) simpleGrading (1 1 1)
    hex (20 24 25 21 46 50 51 47) (70 20 1) simpleGrading (1 1 1)
);


edges
(
);

boundary
(
    wall
    {
        type wall;
        faces
        (
	   	(3 7 33 29)
		(7 11 37 33)
		(10 11 37 36)
		(9 10 36 35)
		(9 13 39 35)
		(13 15 41 39)
		(15 16 42 41)
		(16 17 43 42)
		(17 21 47 43)
		(21 25 51 47)		
	
		(0 4 30 26)
		(4 8 34 30)
		(8 12 38 34)
		(12 14 40 38)
		(14 18 44 40)
		(18 22 48 44)
        );
    }

    frontAndBack_pos
    {
        type wedge;
        faces
        (
      	    	(0 4 5 1)
		(1 5 6 2)
		(2 6 7 3)
		(4 8 9 5)
		(5 9 10 6)
		(6 10 11 7)
		(8 12 13 9)
	    	(12 14 15 13)
    		(14 18 19 15)
		(15 19 20 16)
		(16 20 21 17)
    		(18 22 23 19)
		(19 23 24 20)
		(20 24 25 21)
	);
    }
	
   frontAndBack_neg
    {
        type wedge;
        faces
        (
		(26 30 31 27)
		(27 31 32 28)
		(28 32 33 29)
		(30 34 35 31)
		(31 35 36 32)
		(32 36 37 33)
		(34 38 39 35)
		(38 40 41 39)
		(40 44 45 41)
		(41 45 46 42)
		(42 46 47 43)
		(44 48 49 45)
		(45 49 50 46)
		(46 50 51 47)
    	
        );
    }

    inlet
    {
        type patch;
        faces
        (
		(0 1 27 26)
		(1 2 28 27)
		(2 3 29 28)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            	(22 23 49 48)
		(23 24 50 49)
		(24 25 51 50)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
