AO1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 10000000.0;

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
    inlet
{
type	fixedValue;
value	uniform 10000000.0;
}
    outlet
{
type		uniformFixedValue;
uniformValue	table
(
(0 10000000.0)
(4000 9900000.0)
(20000 9900000.0)
(24000 9800000.0)
(40000 9800000.0)
(44000 9700000.0)
(60000 9700000.0)
(64000 9600000.0)
(80000 9600000.0)
(84000 9500000.0)
(100000 9500000.0)
(104000 9400000.0)
(120000 9400000.0)
(124000 9300000.0)
(140000 9300000.0)
(144000 9200000.0)
(160000 9200000.0)
(164000 9100000.0)
(180000 9100000.0)
(184000 9000000.0)
(200000 9000000.0)
(204000 8900000.0)
(220000 8900000.0)
(224000 8800000.0)
(240000 8800000.0)
(244000 8700000.0)
(260000 8700000.0)
(264000 8600000.0)
(280000 8600000.0)
(284000 8500000.0)
(300000 8500000.0)
(304000 8400000.0)
(320000 8400000.0)
(324000 8300000.0)
(340000 8300000.0)
(344000 8200000.0)
(360000 8200000.0)
(364000 8100000.0)
(380000 8100000.0)
(384000 8000000.0)
(400000 8000000.0)
(404000 7900000.0)
(420000 7900000.0)
(424000 7800000.0)
(440000 7800000.0)
(444000 7700000.0)
(460000 7700000.0)
(464000 7600000.0)
(480000 7600000.0)
(484000 7500000.0)
(500000 7500000.0)
(504000 7400000.0)
(520000 7400000.0)
(524000 7300000.0)
(540000 7300000.0)
(544000 7200000.0)
(560000 7200000.0)
(564000 7100000.0)
(580000 7100000.0)
(584000 7000000.0)
(600000 7000000.0)
(604000 6900000.0)
(620000 6900000.0)
(624000 6800000.0)
(640000 6800000.0)
(644000 6700000.0)
(660000 6700000.0)
(664000 6600000.0)
(680000 6600000.0)
(684000 6500000.0)
(700000 6500000.0)
(704000 6400000.0)
(720000 6400000.0)
(724000 6300000.0)
(740000 6300000.0)
(744000 6200000.0)
(760000 6200000.0)
(764000 6100000.0)
(780000 6100000.0)
(784000 6000000.0)
(800000 6000000.0)
(804000 5900000.0)
(820000 5900000.0)
(824000 5800000.0)
(840000 5800000.0)
(844000 5700000.0)
(860000 5700000.0)
(864000 5600000.0)
(880000 5600000.0)
(884000 5500000.0)
(900000 5500000.0)
(904000 5400000.0)
(920000 5400000.0)
(924000 5300000.0)
(940000 5300000.0)
(944000 5200000.0)
(960000 5200000.0)
(964000 5100000.0)
(980000 5100000.0)
(984000 5000000.0)
(1000000 5000000.0)
(1004000 4900000.0)
(1020000 4900000.0)
(1024000 4800000.0)
(1040000 4800000.0)
(1044000 4700000.0)
(1060000 4700000.0)
(1064000 4600000.0)
(1080000 4600000.0)
(1084000 4500000.0)
(1100000 4500000.0)
(1104000 4400000.0)
(1120000 4400000.0)
(1124000 4300000.0)
(1140000 4300000.0)
(1144000 4200000.0)
(1160000 4200000.0)
(1164000 4100000.0)
(1180000 4100000.0)
(1184000 4000000.0)
(1200000 4000000.0)
)
;
}
    center
    {
	type		symmetryPlane;	
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
